#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ПрограммныйИнтерфейс	
	
	//Добавление уведомления для телеграмм-бота
	Функция ДобавитьУведомление(ТекстСообщения) Экспорт 
		
		НовоеУведомление = СоздатьЭлемент();
		НовоеУведомление.ТекстСообщения = ТекстСообщения; 
		
		Попытка 
			
			НовоеУведомление.Записать(); 
			Возврат НовоеУведомление;
			
		Исключение
			
			Возврат Неопределено;
			
		КонецПопытки;
		
		
	КонецФункции
	
	#КонецОбласти
	
#КонецЕсли