
#Область СлужебныеПроцедурыИФункции 

Функция ЗаполнениеТабличнойЧастиМассовогоСозданияАктов(Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
		|	ДоговорыКонтрагентов.Владелец КАК Владелец,
		|	ДоговорыКонтрагентов.Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_ДоговорыАО
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ДокументыРеализации
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	МЕСЯЦ(РеализацияТоваровУслуг.Дата) = МЕСЯЦ(&Период)
		|	И ГОД(РеализацияТоваровУслуг.Дата) = ГОД(&Период)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДоговорыАО.Ссылка КАК Договор,
		|	ВТ_ДоговорыАО.Владелец КАК Контрагент,
		|	ВТ_ДоговорыАО.Организация КАК Организация,
		|	ВТ_ДокументыРеализации.Ссылка Как ДокументРеализации
		|ИЗ
		|	ВТ_ДоговорыАО КАК ВТ_ДоговорыАО
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыРеализации КАК ВТ_ДокументыРеализации
		|		ПО ВТ_ДоговорыАО.Ссылка = ВТ_ДокументыРеализации.Ссылка
		|ГДЕ
		|ВТ_ДокументыРеализации.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("Период", Период);
	
	НашлиДокументы = Запрос.Выполнить().Выгрузить();
	
	МассивСозданныхДокументов = Новый Массив;
	
	Для Каждого Строка из НашлиДокументы Цикл
	
		НовыйДокументРеализации = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
        НовыйДокументРеализации.Дата = КонецМесяца(Период);
		НовыйДокументРеализации.Ответственный = Пользователи.ТекущийПользователь();
		НовыйДокументРеализации.Договор = Строка.Договор;
		НовыйДокументРеализации.Контрагент = Строка.Контрагент;
		НовыйДокументРеализации.Организация = Строка.Организация;
		НовыйДокументРеализации.ВКМ_ВыполнитьАвтозаполнение();
		НовыйДокументРеализации.Основание = Документы.ЗаказПокупателя.ПустаяСсылка();
		
		Если НовыйДокументРеализации.ПроверитьЗаполнение() Тогда 
			НовыйДокументРеализации.Записать(РежимЗаписиДокумента.Проведение);
					
			СтрокаОбработки = Новый Структура;
			СтрокаОбработки.Вставить("Договор", Строка.Договор);
			СтрокаОбработки.Вставить("ДокументРеализации", НовыйДокументРеализации.Ссылка);
		    
			МассивСозданныхДокументов.Добавить(СтрокаОбработки);
		
		КонецЕсли;
			
	КонецЦикла;

Возврат МассивСозданныхДокументов;

КонецФункции

#КонецОбласти
