#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидСотрудникаПриИзменении(Элемент)
	ВидСотрудникаПриИзмененииНаСервере();
КонецПроцедуры
	

#КонецОбласти



#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВидСотрудникаПриИзмененииНаСервере()


	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_Сотрудники.ВидСотрудника
		|ИЗ
		|	Справочник.ВКМ_Сотрудники КАК ВКМ_Сотрудники
		|ГДЕ
		|	ВКМ_Сотрудники.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Запись.Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Запись.ВидСотрудника = Выборка.ВидСотрудника;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти